//------------------------------------------------------------------------------
// ball.cpp - содержит процедуру ввода параметров
// для уже созданного шара
//------------------------------------------------------------------------------

#include "ball.h"
#include <iostream>


//------------------------------------------------------------------------------
// Ввод параметров шара из файла
void Ball::In(ifstream &ifst) {
    ifst >> radius >> density;
}

// Случайный ввод параметров шара
void Ball::InRnd() {
    radius = Figure::rnd20.Get();
    density = Figure::rndDouble.GetDouble();
}

//------------------------------------------------------------------------------
// Вывод параметров шара в форматируемый поток
void Ball::Out(ofstream &ofst) {
    ofst << "It is Ball: radius = " << radius
         << ". Volume = " << Volume() << ". Density = " << density << "\n";
    std::cout << "It is Ball: radius = " << radius << ". Density = " << density
             << ". Volume = " << Volume() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра шара
double Ball::Volume() {
    return double(4.0 / 3.0 * 3.1415926 * radius * radius * radius);
}



